/************************************************************************************
 **Author:  Axe Tang; Email: axetang@163.com
 **Package: ioutil
 **Element: variable
 **Type:convar
 ------------------------------------------------------------------------------------
 **Definition:
 var Discard io.Writer = devNull(0)
 ------------------------------------------------------------------------------------
 **Description:
 Discard is an io.Writer on which all Write calls succeed without doing anything.
 ------------------------------------------------------------------------------------
 **要点总结:
 Discard是一个io.Writer对象，在这个对象上所有的写操作都成功但不做任何事情。
*************************************************************************************/
package main

func main() {
}
