/************************************************************************************
 **Author:  Axe Tang; Email: axetang@163.com
 **Package: strconv
 **Element: strconv.Itoa
 **Type: func
 ------------------------------------------------------------------------------------
 **Definition:
 func Itoa(i int) string
 ------------------------------------------------------------------------------------
 **Description:
 Itoa is shorthand for FormatInt(int64(i), 10).
 ------------------------------------------------------------------------------------
 **要点总结:
 1. Itoa函数将整数i int转换为字符串返回
 2. Itoa相当于FormatInt(INT64(i),10)
*************************************************************************************/
package main

import (
	"fmt"
	"strconv"
)

func main() {
	i := 10
	s := strconv.Itoa(i)
	fmt.Printf("%T, %v\n", s, s)
}
