/************************************************************************************
 **Author:  Axe Tang; Email: axetang@163.com
 **Package: color
 **Element: color.YCbCrToRGB
 **Type: func
 ------------------------------------------------------------------------------------
 **Definition:
 func YCbCrToRGB(y, cb, cr uint8) (uint8, uint8, uint8)
 ------------------------------------------------------------------------------------
 **Description:
 YCbCrToRGB converts a Y'CbCr triple to an RGB triple.
 ------------------------------------------------------------------------------------
 **要点总结:
 函数将Y'CbCr三原色转换为RGB三原色。
*************************************************************************************/
package main

func main() {
}
