/************************************************************************************
 **Author:  Axe Tang; Email: axetang@163.com
 **Package: color
 **Element: color.CMYKToRGB
 **Type: func
 ------------------------------------------------------------------------------------
 **Definition:
 func CMYKToRGB(c, m, y, k uint8) (uint8, uint8, uint8)
 ------------------------------------------------------------------------------------
 **Description:
 CMYKToRGB converts a CMYK quadruple to an RGB triple.
 ------------------------------------------------------------------------------------
 **要点总结:
 CMYKToRGB将CMYK转换为RGB
*************************************************************************************/
package main

func main() {
}
