/************************************************************************************
 **Author:  Axe Tang; Email: axetang@163.com
 **Package: color
 **Element: color.Alpha
 **Type: struct
 ------------------------------------------------------------------------------------
 **Definition:
 type Alpha struct {
     A uint8
 }
 func (c Alpha) RGBA() (r, g, b, a uint32)
 ------------------------------------------------------------------------------------
 **Description:
 Alpha represents an 8-bit alpha color.
 ------------------------------------------------------------------------------------
 **要点总结:
 Alpha类型代表一个8位的alpha通道（alpha通道表示透明度）。
*************************************************************************************/
package main

func main() {
}
