/************************************************************************************
 **Author:  Axe Tang; Email: axetang@163.com
 **Package: color
 **Element: color.RGBToCMYK
 **Type: func
 ------------------------------------------------------------------------------------
 **Definition:
 func RGBToCMYK(r, g, b uint8) (uint8, uint8, uint8, uint8)
 ------------------------------------------------------------------------------------
 **Description:
 RGBToCMYK converts an RGB triple to a CMYK quadruple.
 ------------------------------------------------------------------------------------
 **要点总结:
 RGBToCMYK将一个RGB三原色转变为CMYK四色。
*************************************************************************************/
package main

func main() {
}
