/************************************************************************************
 **Author:  Axe Tang; Email: axetang@163.com
 **Package: color
 **Element: color.RGBToYCbCr
 **Type: func
 ------------------------------------------------------------------------------------
 **Definition:
 func RGBToYCbCr(r, g, b uint8) (uint8, uint8, uint8)
 ------------------------------------------------------------------------------------
 **Description:
 RGBToYCbCr converts an RGB triple to a Y'CbCr triple.
 ------------------------------------------------------------------------------------
 **要点总结:
 函数将RGB三原色转换为Y'CbCr三原色。
*************************************************************************************/
package main

func main() {
}
