/************************************************************************************
 **Author:  Axe Tang; Email: axetang@163.com
 **Package: expvar
 **Element: expvar.KeyValue
 **Type: struct
 ------------------------------------------------------------------------------------
 **Definition:
 type KeyValue struct {
     Key   string
     Value Var
 }
 KeyValue represents a single entry in a Map.
 ------------------------------------------------------------------------------------
 **Description:
 ------------------------------------------------------------------------------------
 **要点总结:
 1. KeyValue代表Map中的一条记录:键值对.
*************************************************************************************/
package main

func main() {
}
