/************************************************************************************
 **Author:  Axe Tang; Email: axetang@163.com
 **Package: url
 **Element: url.InvalidHostError
 **Type: type
 ------------------------------------------------------------------------------------
 **Definition:
 type InvalidHostError string
 func (e InvalidHostError) Error() string
 ------------------------------------------------------------------------------------
 **Description:
 ------------------------------------------------------------------------------------
 **要点总结:
 0. InvalidHostError记录Host的相关解析错误；
 1. Error方法返回错误信息字符串。
*************************************************************************************/
package main

func main() {
}
