/************************************************************************************
 **Author:  Axe Tang; Email: axetang@163.com
 **Package: image
 **Element: image.Config
 **Type: struct
 ------------------------------------------------------------------------------------
 **Definition:
 type Config struct {
     ColorModel    color.Model
     Width, Height int
 }
 ------------------------------------------------------------------------------------
 **Description:
 Config holds an image's color model and dimensions.
 ------------------------------------------------------------------------------------
 **要点总结:
 1. Config保管图像的色彩模型和尺寸信息。
*************************************************************************************/
package main

func main() {
}
