/************************************************************************************
 **Author:  Axe Tang; Email: axetang@163.com
 **Package: net
 **Element: net.Resolver
 **Type: struct
 ------------------------------------------------------------------------------------
 **Definition:
 type SRV struct {
     Target   string
     Port     uint16
     Priority uint16
     Weight   uint16
 }
 ------------------------------------------------------------------------------------
 **Description:
 An SRV represents a single DNS SRV record.
 ------------------------------------------------------------------------------------
 **要点总结:
 SRV代表一条DNS SRV记录（资源记录），记录某个服务由哪台计算机提供。
*************************************************************************************/
package main

func main() {
}
