/************************************************************************************
 **Author:  Axe Tang; Email: axetang@163.com
 **Package: net
 **Element: net.ResolveIPAddr
 **Type: func
 ------------------------------------------------------------------------------------
 **Definition:
 func ResolveIPAddr(network, address string) (*IPAddr, error)
 ------------------------------------------------------------------------------------
 **Description:
 ResolveIPAddr returns an address of IP end point.
 ------------------------------------------------------------------------------------
 **要点总结:
*************************************************************************************/
package main

func main() {
}
